#+TITLE: March 1-7, 2019 (7 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                             | CANCELED |
|------+------+-------------+---------+------------------------------------------------------------------+----------|
|      |      |             |         | READ.1551715610. Chapter 13. Low-Level Programm (2019-03-07)     |          |
|      |      |             |         | DEV.1551715724. Chapter 13 Exercises (2019-03-07)                |          |
|      |      |             |         | READ.1548140097. NIOS Maths Text Book - Part II (2019-03-07)     |          |
|      |      |             |         | DEV.1550765016. Project Stacknews (2019-03-07)                   |          |
|      |      |             |         | DEV.1551435937. [#A] [[https://bugzilla.mozilla.org (2019-03-07) |          |
|      |      |             |         | DEV.1551436242. [#B] [[https://github.com/deepmind/ (2019-03-07) |          |
|      |      |             |         | DEV.1550682876. Chapter 12 Exercises (2019-03-05)                |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED |            ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+-------------------+------+-----------+--------------+------------|
| Vaibhavk      |        10 | 5.390000000000001 |   10 |         0 |   2019-07-11 | ########## |
| Sandeepk      |         7 |               6.6 |    7 |         0 |   2019-07-11 | ########## |
| Jasonbraganza |      50.0 |               9.5 | 50.0 |         0 |   2019-07-11 | ########## |
| Bhavin192     |       6.5 |              6.13 |  6.5 |         0 |   2019-07-11 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  80 ++--------+---------+---------+---------+---------+---------+--------++   
:     |         ########################################                    |   
:  70 ++                                                ########### #######++   
:     |                                                       IDEAL#....... |   
:  60 ++        ........                                           #       ++   
:     |                 ..                                          #       |   
:     |                   .....                                      #      |   
:  50 ++                       ....                                  #     ++   
:     |                            .                                  #     |   
:  40 ++                            ........                          #    ++   
:     |                                     ..                         #    |   
:  30 ++                                      ........                  #  ++   
:     |                                               ..                #   |   
:  20 ++                                                .....            # ++   
:     |                                                      ....         # |   
:     |                                                          .        # |   
:  10 ++                                                          ........ #+   
:     |                                                                   .*|   
:   0 ++--------+---------+---------+---------+---------+---------+--------+*   
:     0         1         2         3         4         5         6         7   
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:7]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                                                             |
|-----+------------+--------+-------+---------------------------------------------------------------------------------------------|
|   1 | 2019-03-01 |   73.5 |    63 |                                                                                             |
|   2 | 2019-03-02 |   73.5 |    52 |                                                                                             |
|   3 | 2019-03-03 |   73.5 |    42 |                                                                                             |
|   4 | 2019-03-04 |   73.5 |    32 |                                                                                             |
|   5 | 2019-03-05 |   70.0 |    21 | DEV.1550682876                                                                              |
|   6 | 2019-03-06 |   70.0 |    10 |                                                                                             |
|   7 | 2019-03-07 |    0.0 |     0 | DEV.1551436242 DEV.1551435937 DEV.1550765016 READ.1548140097 DEV.1551715724 READ.1551715610 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                              | TASKID          | OWNER         | PRIORITY | TODO | ESTIMATED |             ACTUAL |
|-----------------------------------+-----------------+---------------+----------+------+-----------+--------------------|
| TASKS                             |                 |               | B        |      |      73.5 | 27.619999999999997 |
|-----------------------------------+-----------------+---------------+----------+------+-----------+--------------------|
| bhavin192                         |                 |               | B        |      |       6.5 |               6.13 |
| Learning Golang                   |                 |               | B        |      |       6.5 |               6.13 |
| Chapter 12 Exercises              | DEV.1550682876  | bhavin192     | B        | DONE |       3.5 |               3.38 |
| Chapter 13. Low-Level Programming | READ.1551715610 | bhavin192     | B        | DONE |         2 |               1.20 |
| Chapter 13 Exercises              | DEV.1551715724  | bhavin192     | B        | DONE |         1 |               1.55 |
|-----------------------------------+-----------------+---------------+----------+------+-----------+--------------------|
| jasonbraganza                     |                 |               | B        |      |      50.0 |                9.5 |
| NIOS Maths Text Book - Part II    | READ.1548140097 | jasonbraganza | B        | DONE |      50.0 |               9.50 |
|-----------------------------------+-----------------+---------------+----------+------+-----------+--------------------|
| sandeepk                          |                 |               | B        |      |         7 |                6.6 |
| Project Stacknews                 | DEV.1550765016  | sandeepk      | B        | DONE |         7 |               6.60 |
|-----------------------------------+-----------------+---------------+----------+------+-----------+--------------------|
| vaibhavk                          |                 |               | B        |      |        10 |  5.390000000000001 |
| [[https://bugzilla.mozilla.org/show_bug.cgi?id=1517865][Taskcluster Issue]]                 | DEV.1551435937  | vaibhavk      | A        | DONE |         5 |               3.52 |
| [[https://github.com/deepmind/kapitan/issues/201][Kapitan GSoC task #201 - I]]        | DEV.1551436242  | vaibhavk      | B        | DONE |         5 |               1.87 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 7
  :SPRINTSTART: <2019-03-01 Fri>
  :wpd-bhavin192: 1
  :wpd-jasonbraganza: 11.42
  :wpd-sandeepk: 1
  :wpd-vaibhavk: 1.25
  :END:
** bhavin192
*** Learning Golang
**** DONE Chapter 12 Exercises [2/2]
     CLOSED: [2019-03-05 Tue 21:28]
     :PROPERTIES:
     :ESTIMATED: 3.5
     :ACTUAL:   3.38
     :OWNER:    bhavin192
     :ID:       DEV.1550682876
     :TASKID:   DEV.1550682876
     :END:
     :LOGBOOK:
     CLOCK: [2019-03-05 Tue 21:18]--[2019-03-05 Tue 21:28] =>  0:10
     CLOCK: [2019-03-05 Tue 19:14]--[2019-03-05 Tue 19:40] =>  0:26
     CLOCK: [2019-03-04 Mon 21:02]--[2019-03-04 Mon 21:27] =>  0:25
     CLOCK: [2019-03-04 Mon 19:17]--[2019-03-04 Mon 20:08] =>  0:51
     CLOCK: [2019-03-04 Mon 07:24]--[2019-03-04 Mon 07:37] =>  0:13
     CLOCK: [2019-03-04 Mon 07:00]--[2019-03-04 Mon 07:18] =>  0:18
     CLOCK: [2019-03-03 Sun 13:59]--[2019-03-03 Sun 14:59] =>  1:00
     :END:
     - [X] 12.6 Part II (5.5h)
     - [X] 12.7         (2.5h)
**** DONE Chapter 13. Low-Level Programming [4/4]
     CLOSED: [2019-03-07 Thu 22:52]
     :PROPERTIES:
     :ESTIMATED: 2
     :ACTUAL:   1.20
     :OWNER:    bhavin192
     :ID:       READ.1551715610
     :TASKID:   READ.1551715610
     :END:
     :LOGBOOK:
     CLOCK: [2019-03-07 Thu 22:33]--[2019-03-07 Thu 22:52] =>  0:19
     CLOCK: [2019-03-06 Wed 19:39]--[2019-03-06 Wed 19:51] =>  0:12
     CLOCK: [2019-03-06 Wed 19:05]--[2019-03-06 Wed 19:29] =>  0:24
     CLOCK: [2019-03-06 Wed 18:57]--[2019-03-06 Wed 19:05] =>  0:08
     CLOCK: [2019-03-05 Tue 21:52]--[2019-03-05 Tue 22:01] =>  0:09
     :END:
     - [X] 13.1 unsafe.Sizeof, Alignof, and Offsetof (25m)
     - [X] 13.2 unsafe.Pointer                       (20m)
     - [X] 13.3 Example: Deep Equivalence            (25m)
     - [X] 13.4 Calling C Code with cgo              (45m)
**** DONE Chapter 13 Exercises [1/1]
     CLOSED: [2019-03-07 Thu 22:23]
     :PROPERTIES:
     :ESTIMATED: 1
     :ACTUAL:   1.55
     :OWNER:    bhavin192
     :ID:       DEV.1551715724
     :TASKID:   DEV.1551715724
     :END:
     :LOGBOOK:
     CLOCK: [2019-03-07 Thu 21:20]--[2019-03-07 Thu 22:23] =>  1:03
     CLOCK: [2019-03-07 Thu 19:27]--[2019-03-07 Thu 19:57] =>  0:30
     :END:
     - [X] 13.3 (1h)
** jasonbraganza
*** DONE NIOS Maths Text Book - Part II [0/10]
    CLOSED: [2019-03-07 Thu 23:30]
    :PROPERTIES:
    :ESTIMATED: 50.0
    :ACTUAL:   9.50
    :OWNER: jasonbraganza
    :ID: READ.1548140097
    :TASKID: READ.1548140097
    :END:
    :LOGBOOK:
    CLOCK: [2019-03-05 Tue 08:00]--[2019-03-05 Tue 13:00] =>  5:00
    CLOCK: [2019-03-04 Mon 10:00]--[2019-03-04 Mon 14:30] =>  4:30
    :END:
** sandeepk
*** DONE Project Stacknews [2/2]
    CLOSED: [2019-03-07 Thu 23:35]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:   6.60
    :OWNER: sandeepk
    :ID: DEV.1550765016
    :TASKID: DEV.1550765016
    :END:
    :LOGBOOK:
    CLOCK: [2019-03-07 Thu 22:10]--[2019-03-07 Thu 23:35] =>  1:25
    CLOCK: [2019-03-07 Thu 13:30]--[2019-03-07 Thu 14:30] =>  1:00
    CLOCK: [2019-03-06 Wed 21:30]--[2019-03-06 Wed 22:31] =>  1:01
    CLOCK: [2019-03-04 Mon 23:00]--[2019-03-04 Mon 23:40] =>  0:40
    CLOCK: [2019-03-03 Sun 15:00]--[2019-03-03 Sun 17:30] =>  2:30
    :END:
    - [X] Front End User Interaction Page 4h
    - [X] Landing Page 3h
** vaibhavk
*** DONE [#A] [[https://bugzilla.mozilla.org/show_bug.cgi?id=1517865][Taskcluster Issue]]
    CLOSED: [2019-03-07 Thu 23:30]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   3.52
    :OWNER: vaibhavk
    :ID: DEV.1551435937
    :TASKID: DEV.1551435937
    :END:
    :LOGBOOK:
    CLOCK: [2019-03-03 Sun 12:14]--[2019-03-03 Sun 14:31] =>  2:17
    CLOCK: [2019-03-02 Sat 12:58]--[2019-03-02 Sat 13:30] =>  0:32
    CLOCK: [2019-03-01 Fri 23:58]--[2019-03-02 Sat 00:40] =>  0:42
    :END:
*** DONE [#B] [[https://github.com/deepmind/kapitan/issues/201][Kapitan GSoC task #201 - I]]
    CLOSED: [2019-03-07 Thu 23:30]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   1.87
    :OWNER: vaibhavk
    :ID: DEV.1551436242
    :TASKID: DEV.1551436242
    :END:
    :LOGBOOK:
    CLOCK: [2019-03-05 Tue 18:15]--[2019-03-05 Tue 18:58] =>  0:43
    CLOCK: [2019-03-01 Fri 23:07]--[2019-03-01 Fri 23:48] =>  0:41
    CLOCK: [2019-03-01 Fri 22:07]--[2019-03-01 Fri 22:35] =>  0:28
    :END:
    
